stage1/report/put-wrk-output
Running 5m test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 306.638ms, rate sampling interval: 2779ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   328.43ms  881.78ms   6.07s    89.51%
    Req/Sec     4.96k     1.60k   10.59k    80.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.51ms
 75.000%    8.38ms
 90.000%    1.29s 
 99.000%    4.45s 
 99.900%    5.86s 
 99.990%    6.05s 
 99.999%    6.07s 
100.000%    6.07s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            2         1.00
       0.438     0.100000       144965         1.11
       0.757     0.200000       289663         1.25
       1.032     0.300000       434378         1.43
       1.260     0.400000       578996         1.67
       1.507     0.500000       723213         2.00
       1.712     0.550000       795733         2.22
       1.940     0.600000       867963         2.50
       2.189     0.650000       940242         2.86
       2.487     0.700000      1012640         3.33
       8.375     0.750000      1084809         4.00
      30.687     0.775000      1120971         4.44
      83.647     0.800000      1157141         5.00
     264.191     0.825000      1193311         5.71
     530.943     0.850000      1229517         6.67
     948.223     0.875000      1265628         8.00
    1113.087     0.887500      1283745         8.89
    1288.191     0.900000      1301789        10.00
    1541.119     0.912500      1319923        11.43
    1762.303     0.925000      1337980        13.33
    2004.991     0.937500      1356046        16.00
    2136.063     0.943750      1365174        17.78
    2265.087     0.950000      1374101        20.00
    2480.127     0.956250      1383142        22.86
    2762.751     0.962500      1392173        26.67
    3108.863     0.968750      1401261        32.00
    3203.071     0.971875      1405726        35.56
    3360.767     0.975000      1410260        40.00
    3450.879     0.978125      1414780        45.71
    3526.655     0.981250      1419301        53.33
    3823.615     0.984375      1423821        64.00
    3997.695     0.985938      1426085        71.11
    4171.775     0.987500      1428332        80.00
    4349.951     0.989062      1430631        91.43
    4521.983     0.990625      1432880       106.67
    4698.111     0.992188      1435153       128.00
    4780.031     0.992969      1436271       142.22
    4861.951     0.993750      1437412       160.00
    4943.871     0.994531      1438532       182.86
    5042.175     0.995313      1439638       213.33
    5214.207     0.996094      1440754       256.00
    5304.319     0.996484      1441341       284.44
    5390.335     0.996875      1441898       320.00
    5476.351     0.997266      1442460       365.71
    5562.367     0.997656      1443017       426.67
    5648.383     0.998047      1443602       512.00
    5689.343     0.998242      1443880       568.89
    5730.303     0.998437      1444147       640.00
    5775.359     0.998633      1444444       731.43
    5816.319     0.998828      1444707       853.33
    5861.375     0.999023      1444998      1024.00
    5881.855     0.999121      1445134      1137.78
    5906.431     0.999219      1445290      1280.00
    5926.911     0.999316      1445421      1462.86
    5947.391     0.999414      1445556      1706.67
    5971.967     0.999512      1445716      2048.00
    5980.159     0.999561      1445768      2275.56
    5992.447     0.999609      1445853      2560.00
    6004.735     0.999658      1445932      2925.71
    6012.927     0.999707      1445984      3413.33
    6025.215     0.999756      1446064      4096.00
    6029.311     0.999780      1446093      4551.11
    6037.503     0.999805      1446146      5120.00
    6041.599     0.999829      1446175      5851.43
    6045.695     0.999854      1446204      6826.67
    6049.791     0.999878      1446231      8192.00
    6053.887     0.999890      1446257      9102.22
    6057.983     0.999902      1446284     10240.00
    6057.983     0.999915      1446284     11702.86
    6062.079     0.999927      1446312     13653.33
    6066.175     0.999939      1446396     16384.00
    6066.175     0.999945      1446396     18204.44
    6066.175     0.999951      1446396     20480.00
    6066.175     0.999957      1446396     23405.71
    6066.175     0.999963      1446396     27306.67
    6066.175     0.999969      1446396     32768.00
    6066.175     0.999973      1446396     36408.89
    6066.175     0.999976      1446396     40960.00
    6066.175     0.999979      1446396     46811.43
    6066.175     0.999982      1446396     54613.33
    6066.175     0.999985      1446396     65536.00
    6066.175     0.999986      1446396     72817.78
    6066.175     0.999988      1446396     81920.00
    6066.175     0.999989      1446396     93622.86
    6066.175     0.999991      1446396    109226.67
    6066.175     0.999992      1446396    131072.00
    6066.175     0.999993      1446396    145635.56
    6066.175     0.999994      1446396    163840.00
    6066.175     0.999995      1446396    187245.71
    6066.175     0.999995      1446396    218453.33
    6070.271     0.999996      1446402    262144.00
    6070.271     1.000000      1446402          inf
#[Mean    =      328.430, StdDeviation   =      881.775]
#[Max     =     6066.176, Total count    =      1446402]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1496419 requests in 5.00m, 95.62MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:   4988.07
Transfer/sec:    326.37KB